% Факти, що визначають родо-видові зв'язки (is_a)
is_a(яблуко, фрукт).
is_a(банан, фрукт).
is_a(морква, овоч).
is_a(буряк, овоч).
is_a(свиня, "м'ясо").
is_a(курка, "м'ясо").
is_a(фрукт, їжа).
is_a(овоч, їжа).
is_a("м'ясо", їжа).
is_a(їжа, субстанція).
is_a(яблучний_сік, напій).
is_a(морквяний_сік, напій).
is_a(напій, їжа).

% Факти, що визначають зв'язки частина-ціле (part_of)
part_of(шкірка, яблуко).
part_of(насіння, яблуко).
part_of(стебло, морква).
part_of(листя, буряк).
part_of(крила, курка).
part_of(копита, свиня).
part_of(яблучний_сік, яблуко).
part_of(морквяний_сік, морква).
part_of(шкірка, банан).
part_of(голова, курка).
part_of(голова, свиня).
part_of(яйце, курка).
part_of(банановий_сік, банан).


% Правило для перевірки, чи об'єкт є частиною іншого через зв'язок part_of
is_part_of(X, Y) :- part_of(X, Y).
is_part_of(X, Y) :- part_of(X, Z), is_part_of(Z, Y).

% Правило для перевірки, чи об'єкт належить до певної категорії через зв'язок is_a
belongs_to(X, Y) :- is_a(X, Y).
belongs_to(X, Y) :- is_a(X, Z), belongs_to(Z, Y).

% Демонстраційна процедура
run :- 
    % Виведення прикладів для родо-видових зв'язків
    write('Чи яблуко належить до їжі?'), nl,
    (belongs_to(яблуко, їжа) -> write('Так'), nl ; write('Ні'), nl),
    
    write('Чи банан належить до їжі?'), nl,
    (belongs_to(банан, їжа) -> write('Так'), nl ; write('Ні'), nl),
    
    write('Чи морква належить до їжі?'), nl,
    (belongs_to(морква, їжа) -> write('Так'), nl ; write('Ні'), nl),
    
    % Виведення прикладів для зв'язку частина-ціле
    write('Чи шкірка є частиною яблука?'), nl,
    (is_part_of(шкірка, яблуко) -> write('Так'), nl ; write('Ні'), nl),
    
    write('Чи листя є частиною моркви?'), nl,
    (is_part_of(листя, морква) -> write('Так'), nl ; write('Ні'), nl),
    
    % Додаткові приклади для деревовидної структури з глибиною 3 і розгалуженням не менше 2
    write('Чи яблучний сік належить до їжі?'), nl,
    (belongs_to(яблучний_сік, їжа) -> write('Так'), nl ; write('Ні'), nl).

